Starting experiment on 60 sec data with 2 targets.
loading data
X_train shape: (25642, 1800, 7), y_train shape: (25642,)
X_test shape: (6494, 1800, 7), y_test shape: (6494,)
starting hyperparameter search
Fitting 1 folds for each of 1 candidates, totalling 1 fits
Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 1800, 7)]         0         
_________________________________________________________________
conv1d (Conv1D)              (None, 360, 63)           2268      
_________________________________________________________________
batch_normalization (BatchNo (None, 360, 63)           252       
_________________________________________________________________
re_lu (ReLU)                 (None, 360, 63)           0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 72, 63)            19908     
_________________________________________________________________
batch_normalization_1 (Batch (None, 72, 63)            252       
_________________________________________________________________
re_lu_1 (ReLU)               (None, 72, 63)            0         
_________________________________________________________________
global_max_pooling1d (Global (None, 63)                0         
_________________________________________________________________
dense (Dense)                (None, 32)                2048      
_________________________________________________________________
dropout (Dropout)            (None, 32)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 33        
=================================================================
Total params: 24,761
Trainable params: 24,509
Non-trainable params: 252
_________________________________________________________________
None
finished finding the best hyperparameters
start training best model on complete training and validation data
Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         [(None, 1800, 7)]         0         
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 360, 63)           2268      
_________________________________________________________________
batch_normalization_2 (Batch (None, 360, 63)           252       
_________________________________________________________________
re_lu_2 (ReLU)               (None, 360, 63)           0         
_________________________________________________________________
conv1d_3 (Conv1D)            (None, 72, 63)            19908     
_________________________________________________________________
batch_normalization_3 (Batch (None, 72, 63)            252       
_________________________________________________________________
re_lu_3 (ReLU)               (None, 72, 63)            0         
_________________________________________________________________
global_max_pooling1d_1 (Glob (None, 63)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 32)                2048      
_________________________________________________________________
dropout_1 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 1)                 33        
=================================================================
Total params: 24,761
Trainable params: 24,509
Non-trainable params: 252
_________________________________________________________________
None
log scores and training and test set
  1/802 [..............................] - ETA: 1:10 - loss: 8.2091e-06 - accuracy: 1.0000 20/802 [..............................] - ETA: 2s - loss: 0.0900 - accuracy: 0.9891       38/802 [>.............................] - ETA: 2s - loss: 0.0933 - accuracy: 0.9918 56/802 [=>............................] - ETA: 2s - loss: 0.0962 - accuracy: 0.9922 75/802 [=>............................] - ETA: 2s - loss: 0.1003 - accuracy: 0.9871 93/802 [==>...........................] - ETA: 2s - loss: 0.0902 - accuracy: 0.9896112/802 [===>..........................] - ETA: 1s - loss: 0.0855 - accuracy: 0.9908132/802 [===>..........................] - ETA: 1s - loss: 0.0814 - accuracy: 0.9910150/802 [====>.........................] - ETA: 1s - loss: 0.0817 - accuracy: 0.9892170/802 [=====>........................] - ETA: 1s - loss: 0.0740 - accuracy: 0.9893189/802 [======>.......................] - ETA: 1s - loss: 0.0746 - accuracy: 0.9893208/802 [======>.......................] - ETA: 1s - loss: 0.0768 - accuracy: 0.9878227/802 [=======>......................] - ETA: 1s - loss: 0.0766 - accuracy: 0.9879246/802 [========>.....................] - ETA: 1s - loss: 0.0758 - accuracy: 0.9886265/802 [========>.....................] - ETA: 1s - loss: 0.0752 - accuracy: 0.9894284/802 [=========>....................] - ETA: 1s - loss: 0.0702 - accuracy: 0.9901303/802 [==========>...................] - ETA: 1s - loss: 0.0685 - accuracy: 0.9905322/802 [===========>..................] - ETA: 1s - loss: 0.0698 - accuracy: 0.9908341/802 [===========>..................] - ETA: 1s - loss: 0.0672 - accuracy: 0.9911360/802 [============>.................] - ETA: 1s - loss: 0.0651 - accuracy: 0.9908379/802 [=============>................] - ETA: 1s - loss: 0.0658 - accuracy: 0.9909398/802 [=============>................] - ETA: 1s - loss: 0.0693 - accuracy: 0.9908417/802 [==============>...............] - ETA: 1s - loss: 0.0697 - accuracy: 0.9906436/802 [===============>..............] - ETA: 0s - loss: 0.0789 - accuracy: 0.9847455/802 [================>.............] - ETA: 0s - loss: 0.0972 - accuracy: 0.9719473/802 [================>.............] - ETA: 0s - loss: 0.0957 - accuracy: 0.9729492/802 [=================>............] - ETA: 0s - loss: 0.0926 - accuracy: 0.9736511/802 [==================>...........] - ETA: 0s - loss: 0.0909 - accuracy: 0.9742530/802 [==================>...........] - ETA: 0s - loss: 0.0892 - accuracy: 0.9751549/802 [===================>..........] - ETA: 0s - loss: 0.0899 - accuracy: 0.9755568/802 [====================>.........] - ETA: 0s - loss: 0.0891 - accuracy: 0.9760587/802 [====================>.........] - ETA: 0s - loss: 0.0885 - accuracy: 0.9766606/802 [=====================>........] - ETA: 0s - loss: 0.0860 - accuracy: 0.9774624/802 [======================>.......] - ETA: 0s - loss: 0.0835 - accuracy: 0.9780643/802 [=======================>......] - ETA: 0s - loss: 0.0827 - accuracy: 0.9787662/802 [=======================>......] - ETA: 0s - loss: 0.0817 - accuracy: 0.9788681/802 [========================>.....] - ETA: 0s - loss: 0.0886 - accuracy: 0.9754700/802 [=========================>....] - ETA: 0s - loss: 0.0877 - accuracy: 0.9760719/802 [=========================>....] - ETA: 0s - loss: 0.0892 - accuracy: 0.9763738/802 [==========================>...] - ETA: 0s - loss: 0.0907 - accuracy: 0.9764757/802 [===========================>..] - ETA: 0s - loss: 0.0907 - accuracy: 0.9758775/802 [===========================>..] - ETA: 0s - loss: 0.0895 - accuracy: 0.9760794/802 [============================>.] - ETA: 0s - loss: 0.0889 - accuracy: 0.9765802/802 [==============================] - 2s 3ms/step - loss: 0.0881 - accuracy: 0.9767
  1/203 [..............................] - ETA: 2s - loss: 30.8768 - accuracy: 0.0000e+00 21/203 [==>...........................] - ETA: 0s - loss: 16.8930 - accuracy: 0.3393     39/203 [====>.........................] - ETA: 0s - loss: 9.9512 - accuracy: 0.5104  58/203 [=======>......................] - ETA: 0s - loss: 7.4214 - accuracy: 0.5151 77/203 [==========>...................] - ETA: 0s - loss: 6.7096 - accuracy: 0.4781 97/203 [=============>................] - ETA: 0s - loss: 7.5928 - accuracy: 0.4623116/203 [================>.............] - ETA: 0s - loss: 6.4122 - accuracy: 0.5156135/203 [==================>...........] - ETA: 0s - loss: 5.8672 - accuracy: 0.5428154/203 [=====================>........] - ETA: 0s - loss: 7.0900 - accuracy: 0.5254173/203 [========================>.....] - ETA: 0s - loss: 7.5794 - accuracy: 0.5305191/203 [===========================>..] - ETA: 0s - loss: 8.3228 - accuracy: 0.5324203/203 [==============================] - 1s 3ms/step - loss: 8.3534 - accuracy: 0.5359
