Starting experiment on 60 sec data with 2 targets.
loading data
X_train shape: (25642, 1800, 7), y_train shape: (25642,)
X_test shape: (6494, 1800, 7), y_test shape: (6494,)
starting hyperparameter search
Fitting 1 folds for each of 1 candidates, totalling 1 fits
Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 1800, 7)]         0         
_________________________________________________________________
conv1d (Conv1D)              (None, 900, 64)           1408      
_________________________________________________________________
batch_normalization (BatchNo (None, 900, 64)           256       
_________________________________________________________________
re_lu (ReLU)                 (None, 900, 64)           0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 450, 64)           12352     
_________________________________________________________________
batch_normalization_1 (Batch (None, 450, 64)           256       
_________________________________________________________________
re_lu_1 (ReLU)               (None, 450, 64)           0         
_________________________________________________________________
global_average_pooling1d (Gl (None, 64)                0         
_________________________________________________________________
dense (Dense)                (None, 32)                2080      
_________________________________________________________________
dropout (Dropout)            (None, 32)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 33        
=================================================================
Total params: 16,385
Trainable params: 16,129
Non-trainable params: 256
_________________________________________________________________
None
finished finding the best hyperparameters
start training best model on complete training and validation data
Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         [(None, 1800, 7)]         0         
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 900, 64)           1408      
_________________________________________________________________
batch_normalization_2 (Batch (None, 900, 64)           256       
_________________________________________________________________
re_lu_2 (ReLU)               (None, 900, 64)           0         
_________________________________________________________________
conv1d_3 (Conv1D)            (None, 450, 64)           12352     
_________________________________________________________________
batch_normalization_3 (Batch (None, 450, 64)           256       
_________________________________________________________________
re_lu_3 (ReLU)               (None, 450, 64)           0         
_________________________________________________________________
global_average_pooling1d_1 ( (None, 64)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 32)                2080      
_________________________________________________________________
dropout_1 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 1)                 33        
=================================================================
Total params: 16,385
Trainable params: 16,129
Non-trainable params: 256
_________________________________________________________________
None
log scores and training and test set
  1/802 [..............................] - ETA: 1:12 - loss: 8.7326e-04 - accuracy: 1.0000 10/802 [..............................] - ETA: 4s - loss: 0.0014 - accuracy: 1.0000       20/802 [..............................] - ETA: 4s - loss: 0.1128 - accuracy: 0.9359 29/802 [>.............................] - ETA: 4s - loss: 0.2724 - accuracy: 0.8502 39/802 [>.............................] - ETA: 4s - loss: 0.3939 - accuracy: 0.7853 49/802 [>.............................] - ETA: 4s - loss: 0.4114 - accuracy: 0.7717 59/802 [=>............................] - ETA: 4s - loss: 0.4160 - accuracy: 0.7648 69/802 [=>............................] - ETA: 3s - loss: 0.4214 - accuracy: 0.7785 79/802 [=>............................] - ETA: 3s - loss: 0.4536 - accuracy: 0.7536 89/802 [==>...........................] - ETA: 3s - loss: 0.4182 - accuracy: 0.7714 99/802 [==>...........................] - ETA: 3s - loss: 0.3768 - accuracy: 0.7945108/802 [===>..........................] - ETA: 3s - loss: 0.3512 - accuracy: 0.8093117/802 [===>..........................] - ETA: 3s - loss: 0.3362 - accuracy: 0.8162127/802 [===>..........................] - ETA: 3s - loss: 0.3667 - accuracy: 0.8216137/802 [====>.........................] - ETA: 3s - loss: 0.3808 - accuracy: 0.8079147/802 [====>.........................] - ETA: 3s - loss: 0.3731 - accuracy: 0.8112157/802 [====>.........................] - ETA: 3s - loss: 0.3522 - accuracy: 0.8223167/802 [=====>........................] - ETA: 3s - loss: 0.3312 - accuracy: 0.8329177/802 [=====>........................] - ETA: 3s - loss: 0.3143 - accuracy: 0.8416187/802 [=====>........................] - ETA: 3s - loss: 0.3108 - accuracy: 0.8449197/802 [======>.......................] - ETA: 3s - loss: 0.2991 - accuracy: 0.8517207/802 [======>.......................] - ETA: 3s - loss: 0.2854 - accuracy: 0.8584217/802 [=======>......................] - ETA: 3s - loss: 0.2728 - accuracy: 0.8649227/802 [=======>......................] - ETA: 3s - loss: 0.2623 - accuracy: 0.8706237/802 [=======>......................] - ETA: 3s - loss: 0.2535 - accuracy: 0.8759247/802 [========>.....................] - ETA: 2s - loss: 0.2603 - accuracy: 0.8726256/802 [========>.....................] - ETA: 2s - loss: 0.2544 - accuracy: 0.8756266/802 [========>.....................] - ETA: 2s - loss: 0.2528 - accuracy: 0.8773276/802 [=========>....................] - ETA: 2s - loss: 0.2440 - accuracy: 0.8818286/802 [=========>....................] - ETA: 2s - loss: 0.2355 - accuracy: 0.8859296/802 [==========>...................] - ETA: 2s - loss: 0.2284 - accuracy: 0.8898305/802 [==========>...................] - ETA: 2s - loss: 0.2365 - accuracy: 0.8861315/802 [==========>...................] - ETA: 2s - loss: 0.2324 - accuracy: 0.8895325/802 [===========>..................] - ETA: 2s - loss: 0.2322 - accuracy: 0.8907335/802 [===========>..................] - ETA: 2s - loss: 0.2282 - accuracy: 0.8939345/802 [===========>..................] - ETA: 2s - loss: 0.2262 - accuracy: 0.8969354/802 [============>.................] - ETA: 2s - loss: 0.2205 - accuracy: 0.8995364/802 [============>.................] - ETA: 2s - loss: 0.2144 - accuracy: 0.9023374/802 [============>.................] - ETA: 2s - loss: 0.2105 - accuracy: 0.9041384/802 [=============>................] - ETA: 2s - loss: 0.2175 - accuracy: 0.8989394/802 [=============>................] - ETA: 2s - loss: 0.2238 - accuracy: 0.8960404/802 [==============>...............] - ETA: 2s - loss: 0.2258 - accuracy: 0.8946414/802 [==============>...............] - ETA: 2s - loss: 0.2228 - accuracy: 0.8961423/802 [==============>...............] - ETA: 2s - loss: 0.2181 - accuracy: 0.8983432/802 [===============>..............] - ETA: 2s - loss: 0.2175 - accuracy: 0.8992441/802 [===============>..............] - ETA: 1s - loss: 0.2258 - accuracy: 0.8990451/802 [===============>..............] - ETA: 1s - loss: 0.2281 - accuracy: 0.9011461/802 [================>.............] - ETA: 1s - loss: 0.2232 - accuracy: 0.9033471/802 [================>.............] - ETA: 1s - loss: 0.2194 - accuracy: 0.9049481/802 [================>.............] - ETA: 1s - loss: 0.2150 - accuracy: 0.9069491/802 [=================>............] - ETA: 1s - loss: 0.2108 - accuracy: 0.9088501/802 [=================>............] - ETA: 1s - loss: 0.2066 - accuracy: 0.9106511/802 [==================>...........] - ETA: 1s - loss: 0.2053 - accuracy: 0.9112521/802 [==================>...........] - ETA: 1s - loss: 0.2034 - accuracy: 0.9122531/802 [==================>...........] - ETA: 1s - loss: 0.1999 - accuracy: 0.9138541/802 [===================>..........] - ETA: 1s - loss: 0.2009 - accuracy: 0.9131551/802 [===================>..........] - ETA: 1s - loss: 0.1997 - accuracy: 0.9141561/802 [===================>..........] - ETA: 1s - loss: 0.2053 - accuracy: 0.9099571/802 [====================>.........] - ETA: 1s - loss: 0.2127 - accuracy: 0.9060580/802 [====================>.........] - ETA: 1s - loss: 0.2104 - accuracy: 0.9072590/802 [=====================>........] - ETA: 1s - loss: 0.2118 - accuracy: 0.9063599/802 [=====================>........] - ETA: 1s - loss: 0.2089 - accuracy: 0.9077609/802 [=====================>........] - ETA: 1s - loss: 0.2055 - accuracy: 0.9092618/802 [======================>.......] - ETA: 0s - loss: 0.2025 - accuracy: 0.9105628/802 [======================>.......] - ETA: 0s - loss: 0.1995 - accuracy: 0.9119638/802 [======================>.......] - ETA: 0s - loss: 0.2006 - accuracy: 0.9116648/802 [=======================>......] - ETA: 0s - loss: 0.1976 - accuracy: 0.9130657/802 [=======================>......] - ETA: 0s - loss: 0.1960 - accuracy: 0.9141666/802 [=======================>......] - ETA: 0s - loss: 0.2026 - accuracy: 0.9097675/802 [========================>.....] - ETA: 0s - loss: 0.2041 - accuracy: 0.9084684/802 [========================>.....] - ETA: 0s - loss: 0.2059 - accuracy: 0.9078694/802 [========================>.....] - ETA: 0s - loss: 0.2051 - accuracy: 0.9082704/802 [=========================>....] - ETA: 0s - loss: 0.2074 - accuracy: 0.9080713/802 [=========================>....] - ETA: 0s - loss: 0.2195 - accuracy: 0.9003723/802 [==========================>...] - ETA: 0s - loss: 0.2218 - accuracy: 0.8990733/802 [==========================>...] - ETA: 0s - loss: 0.2255 - accuracy: 0.8978743/802 [==========================>...] - ETA: 0s - loss: 0.2269 - accuracy: 0.8976753/802 [===========================>..] - ETA: 0s - loss: 0.2248 - accuracy: 0.8989763/802 [===========================>..] - ETA: 0s - loss: 0.2248 - accuracy: 0.8991773/802 [===========================>..] - ETA: 0s - loss: 0.2220 - accuracy: 0.9004783/802 [============================>.] - ETA: 0s - loss: 0.2193 - accuracy: 0.9017793/802 [============================>.] - ETA: 0s - loss: 0.2171 - accuracy: 0.9029802/802 [==============================] - 4s 5ms/step - loss: 0.2149 - accuracy: 0.9039
  1/203 [..............................] - ETA: 2s - loss: 6.7147 - accuracy: 0.0000e+00 11/203 [>.............................] - ETA: 1s - loss: 4.2606 - accuracy: 0.1676     21/203 [==>...........................] - ETA: 0s - loss: 4.0055 - accuracy: 0.2500 31/203 [===>..........................] - ETA: 0s - loss: 3.1694 - accuracy: 0.3690 41/203 [=====>........................] - ETA: 0s - loss: 2.9878 - accuracy: 0.3994 51/203 [======>.......................] - ETA: 0s - loss: 2.4613 - accuracy: 0.4951 60/203 [=======>......................] - ETA: 0s - loss: 2.4391 - accuracy: 0.4714 70/203 [=========>....................] - ETA: 0s - loss: 2.4313 - accuracy: 0.4558 80/203 [==========>...................] - ETA: 0s - loss: 2.8827 - accuracy: 0.4410 89/203 [============>.................] - ETA: 0s - loss: 3.0027 - accuracy: 0.4108 98/203 [=============>................] - ETA: 0s - loss: 2.7772 - accuracy: 0.4439107/203 [==============>...............] - ETA: 0s - loss: 2.5550 - accuracy: 0.4848116/203 [================>.............] - ETA: 0s - loss: 2.3655 - accuracy: 0.5229126/203 [=================>............] - ETA: 0s - loss: 2.2213 - accuracy: 0.5422136/203 [===================>..........] - ETA: 0s - loss: 2.1192 - accuracy: 0.5503146/203 [====================>.........] - ETA: 0s - loss: 2.1169 - accuracy: 0.5544156/203 [======================>.......] - ETA: 0s - loss: 2.3405 - accuracy: 0.5208166/203 [=======================>......] - ETA: 0s - loss: 2.4484 - accuracy: 0.5113176/203 [=========================>....] - ETA: 0s - loss: 2.3093 - accuracy: 0.5391186/203 [==========================>...] - ETA: 0s - loss: 2.3500 - accuracy: 0.5459195/203 [===========================>..] - ETA: 0s - loss: 2.5608 - accuracy: 0.5306203/203 [==============================] - 1s 5ms/step - loss: 2.5160 - accuracy: 0.5325
