Starting experiment on 60 sec data with 2 targets.
loading data
X_train shape: (26642, 1800, 7), y_train shape: (26642,)
X_test shape: (6494, 1800, 7), y_test shape: (6494,)
starting hyperparameter search
Fitting 1 folds for each of 1 candidates, totalling 1 fits
Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 1800, 7)]         0         
_________________________________________________________________
conv1d (Conv1D)              (None, 600, 44)           1584      
_________________________________________________________________
batch_normalization (BatchNo (None, 600, 44)           176       
_________________________________________________________________
re_lu (ReLU)                 (None, 600, 44)           0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 200, 44)           9724      
_________________________________________________________________
batch_normalization_1 (Batch (None, 200, 44)           176       
_________________________________________________________________
re_lu_1 (ReLU)               (None, 200, 44)           0         
_________________________________________________________________
global_max_pooling1d (Global (None, 44)                0         
_________________________________________________________________
dense (Dense)                (None, 32)                1440      
_________________________________________________________________
dropout (Dropout)            (None, 32)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 33        
=================================================================
Total params: 13,133
Trainable params: 12,957
Non-trainable params: 176
_________________________________________________________________
None
finished finding the best hyperparameters
start training best model on complete training and validation data
Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         [(None, 1800, 7)]         0         
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 600, 44)           1584      
_________________________________________________________________
batch_normalization_2 (Batch (None, 600, 44)           176       
_________________________________________________________________
re_lu_2 (ReLU)               (None, 600, 44)           0         
_________________________________________________________________
conv1d_3 (Conv1D)            (None, 200, 44)           9724      
_________________________________________________________________
batch_normalization_3 (Batch (None, 200, 44)           176       
_________________________________________________________________
re_lu_3 (ReLU)               (None, 200, 44)           0         
_________________________________________________________________
global_max_pooling1d_1 (Glob (None, 44)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 32)                1440      
_________________________________________________________________
dropout_1 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 1)                 33        
=================================================================
Total params: 13,133
Trainable params: 12,957
Non-trainable params: 176
_________________________________________________________________
None
log scores and training and test set
  1/833 [..............................] - ETA: 1:21 - loss: 0.0348 - accuracy: 1.0000 16/833 [..............................] - ETA: 2s - loss: 0.0905 - accuracy: 0.9766   31/833 [>.............................] - ETA: 2s - loss: 0.0561 - accuracy: 0.9849 45/833 [>.............................] - ETA: 2s - loss: 0.0459 - accuracy: 0.9889 60/833 [=>............................] - ETA: 2s - loss: 0.0423 - accuracy: 0.9896 75/833 [=>............................] - ETA: 2s - loss: 0.0425 - accuracy: 0.9896 89/833 [==>...........................] - ETA: 2s - loss: 0.0450 - accuracy: 0.9881102/833 [==>...........................] - ETA: 2s - loss: 0.0517 - accuracy: 0.9856114/833 [===>..........................] - ETA: 2s - loss: 0.0571 - accuracy: 0.9846128/833 [===>..........................] - ETA: 2s - loss: 0.0521 - accuracy: 0.9858141/833 [====>.........................] - ETA: 2s - loss: 0.0490 - accuracy: 0.9863153/833 [====>.........................] - ETA: 2s - loss: 0.0455 - accuracy: 0.9873167/833 [=====>........................] - ETA: 2s - loss: 0.0499 - accuracy: 0.9858181/833 [=====>........................] - ETA: 2s - loss: 0.0492 - accuracy: 0.9858193/833 [=====>........................] - ETA: 2s - loss: 0.0479 - accuracy: 0.9858206/833 [======>.......................] - ETA: 2s - loss: 0.0460 - accuracy: 0.9863219/833 [======>.......................] - ETA: 2s - loss: 0.0456 - accuracy: 0.9869232/833 [=======>......................] - ETA: 2s - loss: 0.0458 - accuracy: 0.9868246/833 [=======>......................] - ETA: 2s - loss: 0.0437 - accuracy: 0.9876259/833 [========>.....................] - ETA: 2s - loss: 0.0427 - accuracy: 0.9877270/833 [========>.....................] - ETA: 2s - loss: 0.0433 - accuracy: 0.9876283/833 [=========>....................] - ETA: 2s - loss: 0.0424 - accuracy: 0.9880296/833 [=========>....................] - ETA: 2s - loss: 0.0407 - accuracy: 0.9885310/833 [==========>...................] - ETA: 2s - loss: 0.0390 - accuracy: 0.9889322/833 [==========>...................] - ETA: 1s - loss: 0.0380 - accuracy: 0.9890335/833 [===========>..................] - ETA: 1s - loss: 0.0376 - accuracy: 0.9891349/833 [===========>..................] - ETA: 1s - loss: 0.0368 - accuracy: 0.9894362/833 [============>.................] - ETA: 1s - loss: 0.0371 - accuracy: 0.9891375/833 [============>.................] - ETA: 1s - loss: 0.0370 - accuracy: 0.9888388/833 [============>.................] - ETA: 1s - loss: 0.0357 - accuracy: 0.9892402/833 [=============>................] - ETA: 1s - loss: 0.0360 - accuracy: 0.9891415/833 [=============>................] - ETA: 1s - loss: 0.0374 - accuracy: 0.9883427/833 [==============>...............] - ETA: 1s - loss: 0.0390 - accuracy: 0.9878439/833 [==============>...............] - ETA: 1s - loss: 0.0399 - accuracy: 0.9876451/833 [===============>..............] - ETA: 1s - loss: 0.0396 - accuracy: 0.9875463/833 [===============>..............] - ETA: 1s - loss: 0.0406 - accuracy: 0.9873476/833 [================>.............] - ETA: 1s - loss: 0.0411 - accuracy: 0.9867489/833 [================>.............] - ETA: 1s - loss: 0.0402 - accuracy: 0.9869502/833 [=================>............] - ETA: 1s - loss: 0.0394 - accuracy: 0.9872516/833 [=================>............] - ETA: 1s - loss: 0.0399 - accuracy: 0.9869530/833 [==================>...........] - ETA: 1s - loss: 0.0392 - accuracy: 0.9870543/833 [==================>...........] - ETA: 1s - loss: 0.0385 - accuracy: 0.9873555/833 [==================>...........] - ETA: 1s - loss: 0.0383 - accuracy: 0.9873568/833 [===================>..........] - ETA: 1s - loss: 0.0377 - accuracy: 0.9875581/833 [===================>..........] - ETA: 0s - loss: 0.0373 - accuracy: 0.9877593/833 [====================>.........] - ETA: 0s - loss: 0.0381 - accuracy: 0.9875606/833 [====================>.........] - ETA: 0s - loss: 0.0387 - accuracy: 0.9871620/833 [=====================>........] - ETA: 0s - loss: 0.0398 - accuracy: 0.9869634/833 [=====================>........] - ETA: 0s - loss: 0.0394 - accuracy: 0.9870647/833 [======================>.......] - ETA: 0s - loss: 0.0387 - accuracy: 0.9872661/833 [======================>.......] - ETA: 0s - loss: 0.0380 - accuracy: 0.9874674/833 [=======================>......] - ETA: 0s - loss: 0.0374 - accuracy: 0.9876686/833 [=======================>......] - ETA: 0s - loss: 0.0372 - accuracy: 0.9876696/833 [========================>.....] - ETA: 0s - loss: 0.0376 - accuracy: 0.9874710/833 [========================>.....] - ETA: 0s - loss: 0.0404 - accuracy: 0.9867723/833 [=========================>....] - ETA: 0s - loss: 0.0402 - accuracy: 0.9866734/833 [=========================>....] - ETA: 0s - loss: 0.0403 - accuracy: 0.9865747/833 [=========================>....] - ETA: 0s - loss: 0.0411 - accuracy: 0.9861761/833 [==========================>...] - ETA: 0s - loss: 0.0418 - accuracy: 0.9859774/833 [==========================>...] - ETA: 0s - loss: 0.0454 - accuracy: 0.9854785/833 [===========================>..] - ETA: 0s - loss: 0.0449 - accuracy: 0.9856798/833 [===========================>..] - ETA: 0s - loss: 0.0455 - accuracy: 0.9855810/833 [============================>.] - ETA: 0s - loss: 0.0450 - accuracy: 0.9856823/833 [============================>.] - ETA: 0s - loss: 0.0453 - accuracy: 0.9857833/833 [==============================] - 3s 4ms/step - loss: 0.0448 - accuracy: 0.9858
  1/203 [..............................] - ETA: 2s - loss: 0.0348 - accuracy: 1.0000 14/203 [=>............................] - ETA: 0s - loss: 0.0972 - accuracy: 0.9754 28/203 [===>..........................] - ETA: 0s - loss: 0.0606 - accuracy: 0.9844 42/203 [=====>........................] - ETA: 0s - loss: 1.6921 - accuracy: 0.8482 57/203 [=======>......................] - ETA: 0s - loss: 2.9391 - accuracy: 0.7654 72/203 [=========>....................] - ETA: 0s - loss: 4.1824 - accuracy: 0.6853 85/203 [===========>..................] - ETA: 0s - loss: 5.7536 - accuracy: 0.6206 99/203 [=============>................] - ETA: 0s - loss: 5.6082 - accuracy: 0.6140113/203 [===============>..............] - ETA: 0s - loss: 4.9620 - accuracy: 0.6449126/203 [=================>............] - ETA: 0s - loss: 4.6979 - accuracy: 0.6391137/203 [===================>..........] - ETA: 0s - loss: 4.5956 - accuracy: 0.6446149/203 [=====================>........] - ETA: 0s - loss: 5.4451 - accuracy: 0.6279162/203 [======================>.......] - ETA: 0s - loss: 6.1725 - accuracy: 0.5938175/203 [========================>.....] - ETA: 0s - loss: 5.7460 - accuracy: 0.6211186/203 [==========================>...] - ETA: 0s - loss: 5.7351 - accuracy: 0.6262199/203 [============================>.] - ETA: 0s - loss: 5.9419 - accuracy: 0.6068203/203 [==============================] - 1s 4ms/step - loss: 5.9886 - accuracy: 0.6004
