Starting experiment on 60 sec data with 2 targets.
loading data
X_train shape: (25642, 1800, 7), y_train shape: (25642,)
X_test shape: (6494, 1800, 7), y_test shape: (6494,)
starting hyperparameter search
Fitting 1 folds for each of 2 candidates, totalling 2 fits
Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 1800, 7)]         0         
_________________________________________________________________
conv1d (Conv1D)              (None, 360, 63)           2268      
_________________________________________________________________
batch_normalization (BatchNo (None, 360, 63)           252       
_________________________________________________________________
re_lu (ReLU)                 (None, 360, 63)           0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 72, 63)            19908     
_________________________________________________________________
batch_normalization_1 (Batch (None, 72, 63)            252       
_________________________________________________________________
re_lu_1 (ReLU)               (None, 72, 63)            0         
_________________________________________________________________
global_max_pooling1d (Global (None, 63)                0         
_________________________________________________________________
dense (Dense)                (None, 32)                2048      
_________________________________________________________________
dropout (Dropout)            (None, 32)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 33        
=================================================================
Total params: 24,761
Trainable params: 24,509
Non-trainable params: 252
_________________________________________________________________
None
Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         [(None, 1800, 7)]         0         
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 600, 34)           748       
_________________________________________________________________
batch_normalization_2 (Batch (None, 600, 34)           136       
_________________________________________________________________
re_lu_2 (ReLU)               (None, 600, 34)           0         
_________________________________________________________________
global_max_pooling1d_1 (Glob (None, 34)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 32)                1120      
_________________________________________________________________
dropout_1 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 1)                 33        
=================================================================
Total params: 2,037
Trainable params: 1,969
Non-trainable params: 68
_________________________________________________________________
None
finished finding the best hyperparameters
start training best model on complete training and validation data
Model: "model_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_3 (InputLayer)         [(None, 1800, 7)]         0         
_________________________________________________________________
conv1d_3 (Conv1D)            (None, 360, 63)           2268      
_________________________________________________________________
batch_normalization_3 (Batch (None, 360, 63)           252       
_________________________________________________________________
re_lu_3 (ReLU)               (None, 360, 63)           0         
_________________________________________________________________
conv1d_4 (Conv1D)            (None, 72, 63)            19908     
_________________________________________________________________
batch_normalization_4 (Batch (None, 72, 63)            252       
_________________________________________________________________
re_lu_4 (ReLU)               (None, 72, 63)            0         
_________________________________________________________________
global_max_pooling1d_2 (Glob (None, 63)                0         
_________________________________________________________________
dense_4 (Dense)              (None, 32)                2048      
_________________________________________________________________
dropout_2 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_5 (Dense)              (None, 1)                 33        
=================================================================
Total params: 24,761
Trainable params: 24,509
Non-trainable params: 252
_________________________________________________________________
None
log scores and training and test set
  1/802 [..............................] - ETA: 1:10 - loss: 0.0913 - accuracy: 0.9688 16/802 [..............................] - ETA: 14s - loss: 0.1706 - accuracy: 0.9668  35/802 [>.............................] - ETA: 7s - loss: 0.2150 - accuracy: 0.9652  54/802 [=>............................] - ETA: 5s - loss: 0.2366 - accuracy: 0.9641 73/802 [=>............................] - ETA: 4s - loss: 0.2786 - accuracy: 0.9302 92/802 [==>...........................] - ETA: 3s - loss: 0.2578 - accuracy: 0.9361111/802 [===>..........................] - ETA: 3s - loss: 0.2444 - accuracy: 0.9448129/802 [===>..........................] - ETA: 3s - loss: 0.2375 - accuracy: 0.9423148/802 [====>.........................] - ETA: 2s - loss: 0.2481 - accuracy: 0.9367167/802 [=====>........................] - ETA: 2s - loss: 0.2242 - accuracy: 0.9414185/802 [=====>........................] - ETA: 2s - loss: 0.2230 - accuracy: 0.9446204/802 [======>.......................] - ETA: 2s - loss: 0.2180 - accuracy: 0.9494223/802 [=======>......................] - ETA: 2s - loss: 0.2207 - accuracy: 0.9483242/802 [========>.....................] - ETA: 2s - loss: 0.2227 - accuracy: 0.9498261/802 [========>.....................] - ETA: 1s - loss: 0.2200 - accuracy: 0.9515280/802 [=========>....................] - ETA: 1s - loss: 0.2089 - accuracy: 0.9545299/802 [==========>...................] - ETA: 1s - loss: 0.2020 - accuracy: 0.9567318/802 [==========>...................] - ETA: 1s - loss: 0.2006 - accuracy: 0.9585336/802 [===========>..................] - ETA: 1s - loss: 0.1994 - accuracy: 0.9582355/802 [============>.................] - ETA: 1s - loss: 0.1956 - accuracy: 0.9554374/802 [============>.................] - ETA: 1s - loss: 0.1946 - accuracy: 0.9566393/802 [=============>................] - ETA: 1s - loss: 0.2011 - accuracy: 0.9548412/802 [==============>...............] - ETA: 1s - loss: 0.2040 - accuracy: 0.9553431/802 [===============>..............] - ETA: 1s - loss: 0.1991 - accuracy: 0.9569450/802 [===============>..............] - ETA: 1s - loss: 0.2338 - accuracy: 0.9261469/802 [================>.............] - ETA: 1s - loss: 0.2325 - accuracy: 0.9281488/802 [=================>............] - ETA: 1s - loss: 0.2240 - accuracy: 0.9308507/802 [=================>............] - ETA: 0s - loss: 0.2166 - accuracy: 0.9326526/802 [==================>...........] - ETA: 0s - loss: 0.2163 - accuracy: 0.9340545/802 [===================>..........] - ETA: 0s - loss: 0.2149 - accuracy: 0.9352564/802 [====================>.........] - ETA: 0s - loss: 0.2125 - accuracy: 0.9368582/802 [====================>.........] - ETA: 0s - loss: 0.2104 - accuracy: 0.9385601/802 [=====================>........] - ETA: 0s - loss: 0.2073 - accuracy: 0.9402619/802 [======================>.......] - ETA: 0s - loss: 0.2013 - accuracy: 0.9419638/802 [======================>.......] - ETA: 0s - loss: 0.2000 - accuracy: 0.9436657/802 [=======================>......] - ETA: 0s - loss: 0.1994 - accuracy: 0.9418675/802 [========================>.....] - ETA: 0s - loss: 0.2031 - accuracy: 0.9413694/802 [========================>.....] - ETA: 0s - loss: 0.2083 - accuracy: 0.9368712/802 [=========================>....] - ETA: 0s - loss: 0.2118 - accuracy: 0.9371731/802 [==========================>...] - ETA: 0s - loss: 0.2147 - accuracy: 0.9374749/802 [===========================>..] - ETA: 0s - loss: 0.2156 - accuracy: 0.9374768/802 [===========================>..] - ETA: 0s - loss: 0.2146 - accuracy: 0.9360787/802 [============================>.] - ETA: 0s - loss: 0.2119 - accuracy: 0.9375802/802 [==============================] - 3s 3ms/step - loss: 0.2098 - accuracy: 0.9386
  1/203 [..............................] - ETA: 2s - loss: 15.0391 - accuracy: 0.0000e+00 19/203 [=>............................] - ETA: 0s - loss: 7.7604 - accuracy: 0.2977      37/203 [====>.........................] - ETA: 0s - loss: 4.4548 - accuracy: 0.5152 56/203 [=======>......................] - ETA: 0s - loss: 3.4020 - accuracy: 0.5307 75/203 [==========>...................] - ETA: 0s - loss: 2.8342 - accuracy: 0.4863 94/203 [============>.................] - ETA: 0s - loss: 3.4307 - accuracy: 0.4535113/203 [===============>..............] - ETA: 0s - loss: 2.8729 - accuracy: 0.5310132/203 [==================>...........] - ETA: 0s - loss: 2.5489 - accuracy: 0.5578150/203 [=====================>........] - ETA: 0s - loss: 3.1617 - accuracy: 0.5450169/203 [=======================>......] - ETA: 0s - loss: 3.6142 - accuracy: 0.5281187/203 [==========================>...] - ETA: 0s - loss: 3.6395 - accuracy: 0.5495203/203 [==============================] - 1s 3ms/step - loss: 3.8130 - accuracy: 0.5397
